# ProjectLocationSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocationSet Constructor
ProjectLocationSet Class See Also
---
Initializes a new instance of the ProjectLocationSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ProjectLocationSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ProjectLocationSet()
```

# See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace